#!/usr/local/bin/yosys
read_verilog -formal ../../../antikernel-ipcores/noc/rpcv3/RPCv3Transceiver.v
read_verilog -formal main.v
prep -nordff -top main

# yes this is an absolute path, the script to do this in a temp dir hasn't been written yet :)
write_smt2 -wires /tmp/rpcv3transceiver.smt2
